chat_system_1422394811_actor_description=Carl Leonard. King's brother, who gave up the throne.
chat_system_1422394811_switch_0_header_1=^?^Sorry, but I'm too busy right now. I'm going to follow in the footsteps of my great-great-grandfather, King Fandor, and commit myself to traveling.
chat_system_1422394811_switch_0_header_6=^?^Greeting to you, traveler. Unfortunately, I can't devote much time to you... It was such a cloudless night, that I couldn't close my eyes till morning; I study the stars, you see. I'm very tired - can we talk another time?
chat_system_1422394811_snap_3_question=^?^Hello, my dear friend! Did you know that Martha came to me?<br>It's so wonderful! Thank you very much! My life has changed and now I study not only the stars, but also their influence on the human mood - and even on frogs! Martha has told me so many interesting things about life in the swamp, that now I wish to travel there myself!
chat_system_1422394811_snap_3_answer_0=^?^I want to ask you some questions, Carl.
chat_system_1422394811_snap_3_answer_1=^?^I'm glad that you are alright.
chat_system_1422394811_snap_1_question=^?^Finally! Perhaps you are interested in my theory about Endoria's movement in the World's Ocean? Or are you interested in the world's geography during the Titan's Epoch?
chat_system_1422394811_snap_1_answer_0=^?^You said your name is Carl Leonard?
chat_system_1422394811_snap_1_answer_1=^?^Perhaps, yes. The Titan's Epoch is an interest of mine.
chat_system_1422394811_snap_1_header_1=^?^Well I suppose you must know the time when there were no people, no elves or other such creatures, and the Titans ruled Endoria. They were the first intelligent race to be created by the Gods.<br>At that time there were none of the continents known to us today - neither Darion, nor Ellinia, nor Kordar. All was a single continent. But the Gods became enraged, and struck our world, so violently that the continent split into three parts. Thus modern geography is really quite young...
chat_system_1422394811_snap_1_answer_2=^?^I'd like to know more about our world.
chat_system_1422394811_snap_1_answer_3=^?^No, I have no questions.
chat_system_1422394811_snap_2_question=^?^Yes, you are right... I belong to the Leonard dynasty, and our good King Mark is my younger brother.
chat_system_1422394811_snap_2_answer_0=^?^And you work here... in an observatory, and he rules?
chat_system_1422394811_snap_2_header_0=^?^Yes, I rescinded the throne. You know, young man, it is far more interesting for me to conduct research, than it would be to sit on a throne, sealing edicts and such.
chat_system_1422394811_snap_4_question=^?^Great! Wonderful! Perhaps, I'll tell you my theory... It is really quite interesting - I even submitted my research to the department of Geography, and my research may even win the Fandor's prize!<br>Now, then... I have been observing the movement of the heavenly bodies for a long time, and I've discovered a very interesting regularity, which gave me the crazy but profound idea, which could transform our entire view of the universe!
chat_system_1422394811_snap_4_answer_0=^?^Very interesting... Please go on...
chat_system_1422394811_snap_5_question=^?^Of course, I had to double-check everything. I asked for the assistance of the Geographers' Guild, and collected all the information we have on earthquakes and weather cycles over the last two hundred years.<br>Finally, I can say with certainty that our world is not a flat disk as the old know-it-alls claim. Moreover, it is not even a convex disk, as our more enlightened scientists nowadays believe...
chat_system_1422394811_snap_5_answer_0=^?^So, do you agree with those madmen who consider our world to be round like a ball and suspended in the air, without support of any kind?
chat_system_1422394811_snap_6_question=^?^Is that some kind of joke!? Do I look like a madman? Of course our world isn't a sphere. It really looks like a convex disk, but it doesn't hang in the air as Fandor's followers assert. Nor is it an island in the Great Ocean, as the followers of Gulliver believe. Though they are correct in a way...<br>My research leads me to believe that, in truth, our world sits on the back of a huge moving animal!
chat_system_1422394811_snap_6_answer_0=^?^Ha-ha... That's right, that's right... Our world rests on the backs of three elephants, and they in turn stand upon a great turtle!
chat_system_1422394811_snap_6_header_0=^?^Well, young man, I see that you don't believe me. But modern science moves ever forward. In time, modern astronomy will prove my ideas to everyone!<br>Ok, [player], will that be all, or do you have any more questions for me?
chat_system_1422394811_snap_0_question=^?^Good afternoon, traveler. It is not often that a guest comes to my observatory! My name is Carl, and I study the stars here.<br>Perhaps you wish to speak with me? I can tell you quite a lot about the system of our world. Indeed, I have one interesting theory...
chat_system_1422394811_snap_0_answer_0=^?^I'd like to ask you some questions, Carl.
chat_system_1422394811_snap_0_answer_1=^?^Ok, sleep well...
chat_system_1422394811_snap_0_answer_2=^?^I'm in a hurry. I'll drop in sometime later, and we can have a little chat...
chat_system_1422394811_snap_3_answer_7=^?^Do you have any use for Griffin Eggs?
chat_system_1422394811_snap_3_answer_8=^?^About the Griffin Eggs...
chat_system_1422394811_snap_16_question=^?^Griffin Eggs? That's it my boy! I don't have time to go to Harl, but if you bring me some eggs, I'm sure we can trade something of import.
chat_system_1422394811_snap_16_answer_0=^?^Really?! I was thinking something along the lines of Magic Crystals...
chat_system_1422394811_snap_17_question=^?^Magic Crystals? Yes... that would be perfect! I do have a collection of them. Let's see, how many... let's say 1 Magic Crystal for 30 Griffin Eggs. How does that sound, young man?
chat_system_1422394811_snap_17_answer_0=^?^I think that sounds great, Carl! Let me go find some...
chat_system_1422394811_snap_17_answer_1=^?^I think that sounds great, Carl! I've got some on me, let's see if we can trade...
chat_system_1422394811_snap_18_question=^?^Do you have some Griffin Eggs, young man?
chat_system_1422394811_snap_18_answer_0=^?^No, I haven't found any yet...
chat_system_1422394811_snap_18_answer_1=^?^I have some, but I don't have enough.
chat_system_1422394811_snap_18_answer_2=^?^[img_crystal] Receive 1 Magic Crystal for 30 Griffin Eggs.
chat_system_1422394811_snap_18_answer_3=^?^[img_crystal] Receive 2 Magic Crystals for 60 Griffin Eggs.
chat_system_1422394811_snap_18_answer_4=^?^[img_crystal] Receive 5 Magic Crystals for 150 Griffin Eggs.
chat_system_1422394811_snap_18_answer_5=^?^[img_crystal] Receive 10 Magic Crystals for 300 Griffin Eggs.
chat_system_1422394811_snap_18_answer_7=^?^You know, I've gotta go...
chat_system_1422394811_snap_19_question=^?^I'll be traveling soon young man, but I'm sure you'll find some more! Don't forget, you need at least 30 eggs to trade!
chat_system_1422394811_snap_19_answer_0=^?^Yes - let me go find some more...
chat_system_1422394811_snap_20_question=^?^Here take this Magic Crystal young man. These will be perfect for our voyage!
chat_system_1422394811_snap_20_answer_0=^?^I've got more - let's trade some more...
chat_system_1422394811_snap_20_answer_1=^?^I've gotta go...
chat_system_1422394811_snap_21_question=^?^Here take these Magic Crystals young man. Ahh! So many eggs! This should be plenty for our voyage!
chat_system_1422394811_snap_21_answer_0=^?^I've got more - let's trade some more...
chat_system_1422394811_snap_21_answer_1=^?^I've gotta go...
chat_system_1422394811_snap_22_question=^?^I'll be traveling soon young man, but I'm sure you'll find some! Don't forget, you need at least 30 eggs to trade!
chat_system_1422394811_snap_22_answer_0=^?^Yes, I'm sure I'll find some soon...